EfficientDet(
  (backbone): FeatureListNet(
    (conv1): Conv2d(3, 64, kernel_size=(7, 7), stride=(2, 2), padding=(3, 3), bias=False)
    (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (act1): ReLU(inplace=True)
    (maxpool): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
    (layer1): Sequential(
      (0): Bottleneck(
        (conv1): Conv2d(64, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn1): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act1): ReLU(inplace=True)
        (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
        (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (drop_block): Identity()
        (act2): ReLU(inplace=True)
        (aa): Identity()
        (conv3): Conv2d(32, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn3): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act3): ReLU(inplace=True)
        (downsample): Sequential(
          (0): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
      (1): Bottleneck(
        (conv1): Conv2d(256, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn1): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act1): ReLU(inplace=True)
        (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
        (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (drop_block): Identity()
        (act2): ReLU(inplace=True)
        (aa): Identity()
        (conv3): Conv2d(32, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn3): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act3): ReLU(inplace=True)
      )
      (2): Bottleneck(
        (conv1): Conv2d(256, 32, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn1): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act1): ReLU(inplace=True)
        (conv2): Conv2d(32, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
        (bn2): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (drop_block): Identity()
        (act2): ReLU(inplace=True)
        (aa): Identity()
        (conv3): Conv2d(32, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn3): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act3): ReLU(inplace=True)
      )
    )
    (layer2): Sequential(
      (0): Bottleneck(
        (conv1): Conv2d(256, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act1): ReLU(inplace=True)
        (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1), bias=False)
        (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (drop_block): Identity()
        (act2): ReLU(inplace=True)
        (aa): Identity()
        (conv3): Conv2d(64, 512, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn3): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act3): ReLU(inplace=True)
        (downsample): Sequential(
          (0): Conv2d(256, 512, kernel_size=(1, 1), stride=(2, 2), bias=False)
          (1): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
      (1): Bottleneck(
        (conv1): Conv2d(512, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act1): ReLU(inplace=True)
        (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
        (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (drop_block): Identity()
        (act2): ReLU(inplace=True)
        (aa): Identity()
        (conv3): Conv2d(64, 512, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn3): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act3): ReLU(inplace=True)
      )
      (2): Bottleneck(
        (conv1): Conv2d(512, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act1): ReLU(inplace=True)
        (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
        (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (drop_block): Identity()
        (act2): ReLU(inplace=True)
        (aa): Identity()
        (conv3): Conv2d(64, 512, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn3): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act3): ReLU(inplace=True)
      )
      (3): Bottleneck(
        (conv1): Conv2d(512, 64, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn1): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act1): ReLU(inplace=True)
        (conv2): Conv2d(64, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
        (bn2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (drop_block): Identity()
        (act2): ReLU(inplace=True)
        (aa): Identity()
        (conv3): Conv2d(64, 512, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn3): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act3): ReLU(inplace=True)
      )
    )
    (layer3): Sequential(
      (0): Bottleneck(
        (conv1): Conv2d(512, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act1): ReLU(inplace=True)
        (conv2): Conv2d(128, 128, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1), bias=False)
        (bn2): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (drop_block): Identity()
        (act2): ReLU(inplace=True)
        (aa): Identity()
        (conv3): Conv2d(128, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act3): ReLU(inplace=True)
        (downsample): Sequential(
          (0): Conv2d(512, 1024, kernel_size=(1, 1), stride=(2, 2), bias=False)
          (1): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
      (1): Bottleneck(
        (conv1): Conv2d(1024, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act1): ReLU(inplace=True)
        (conv2): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
        (bn2): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (drop_block): Identity()
        (act2): ReLU(inplace=True)
        (aa): Identity()
        (conv3): Conv2d(128, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act3): ReLU(inplace=True)
      )
      (2): Bottleneck(
        (conv1): Conv2d(1024, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act1): ReLU(inplace=True)
        (conv2): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
        (bn2): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (drop_block): Identity()
        (act2): ReLU(inplace=True)
        (aa): Identity()
        (conv3): Conv2d(128, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act3): ReLU(inplace=True)
      )
      (3): Bottleneck(
        (conv1): Conv2d(1024, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act1): ReLU(inplace=True)
        (conv2): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
        (bn2): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (drop_block): Identity()
        (act2): ReLU(inplace=True)
        (aa): Identity()
        (conv3): Conv2d(128, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act3): ReLU(inplace=True)
      )
      (4): Bottleneck(
        (conv1): Conv2d(1024, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act1): ReLU(inplace=True)
        (conv2): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
        (bn2): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (drop_block): Identity()
        (act2): ReLU(inplace=True)
        (aa): Identity()
        (conv3): Conv2d(128, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act3): ReLU(inplace=True)
      )
      (5): Bottleneck(
        (conv1): Conv2d(1024, 128, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act1): ReLU(inplace=True)
        (conv2): Conv2d(128, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
        (bn2): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (drop_block): Identity()
        (act2): ReLU(inplace=True)
        (aa): Identity()
        (conv3): Conv2d(128, 1024, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn3): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act3): ReLU(inplace=True)
      )
    )
    (layer4): Sequential(
      (0): Bottleneck(
        (conv1): Conv2d(1024, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act1): ReLU(inplace=True)
        (conv2): Conv2d(256, 256, kernel_size=(3, 3), stride=(2, 2), padding=(1, 1), bias=False)
        (bn2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (drop_block): Identity()
        (act2): ReLU(inplace=True)
        (aa): Identity()
        (conv3): Conv2d(256, 2048, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn3): BatchNorm2d(2048, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act3): ReLU(inplace=True)
        (downsample): Sequential(
          (0): Conv2d(1024, 2048, kernel_size=(1, 1), stride=(2, 2), bias=False)
          (1): BatchNorm2d(2048, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
      (1): Bottleneck(
        (conv1): Conv2d(2048, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act1): ReLU(inplace=True)
        (conv2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
        (bn2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (drop_block): Identity()
        (act2): ReLU(inplace=True)
        (aa): Identity()
        (conv3): Conv2d(256, 2048, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn3): BatchNorm2d(2048, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act3): ReLU(inplace=True)
      )
      (2): Bottleneck(
        (conv1): Conv2d(2048, 256, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn1): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act1): ReLU(inplace=True)
        (conv2): Conv2d(256, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
        (bn2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (drop_block): Identity()
        (act2): ReLU(inplace=True)
        (aa): Identity()
        (conv3): Conv2d(256, 2048, kernel_size=(1, 1), stride=(1, 1), bias=False)
        (bn3): BatchNorm2d(2048, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (act3): ReLU(inplace=True)
      )
    )
  )
  (fpn): BiFpn(
    (resample): ModuleDict(
      (3): ResampleFeatureMap(
        (conv): ConvBnAct2d(
          (conv): Conv2d(2048, 88, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
        )
        (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
      )
      (4): ResampleFeatureMap(
        (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
      )
    )
    (cell): SequentialList(
      (0): BiFpnLayer(
        (fnode): ModuleList(
          (0): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (3): ResampleFeatureMap()
                (4): ResampleFeatureMap(
                  (upsample): Interpolate2d()
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (1): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (2): ResampleFeatureMap(
                  (conv): ConvBnAct2d(
                    (conv): Conv2d(2048, 88, kernel_size=(1, 1), stride=(1, 1), bias=False)
                    (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
                  )
                )
                (5): ResampleFeatureMap(
                  (upsample): Interpolate2d()
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (2): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (1): ResampleFeatureMap(
                  (conv): ConvBnAct2d(
                    (conv): Conv2d(1024, 88, kernel_size=(1, 1), stride=(1, 1), bias=False)
                    (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
                  )
                )
                (6): ResampleFeatureMap(
                  (upsample): Interpolate2d()
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (3): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (0): ResampleFeatureMap(
                  (conv): ConvBnAct2d(
                    (conv): Conv2d(512, 88, kernel_size=(1, 1), stride=(1, 1), bias=False)
                    (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
                  )
                )
                (7): ResampleFeatureMap(
                  (upsample): Interpolate2d()
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (4): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (1): ResampleFeatureMap(
                  (conv): ConvBnAct2d(
                    (conv): Conv2d(1024, 88, kernel_size=(1, 1), stride=(1, 1), bias=False)
                    (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
                  )
                )
                (7): ResampleFeatureMap()
                (8): ResampleFeatureMap(
                  (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (5): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (2): ResampleFeatureMap(
                  (conv): ConvBnAct2d(
                    (conv): Conv2d(2048, 88, kernel_size=(1, 1), stride=(1, 1), bias=False)
                    (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
                  )
                )
                (6): ResampleFeatureMap()
                (9): ResampleFeatureMap(
                  (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (6): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (3): ResampleFeatureMap()
                (5): ResampleFeatureMap()
                (10): ResampleFeatureMap(
                  (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (7): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (4): ResampleFeatureMap()
                (11): ResampleFeatureMap(
                  (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
        )
      )
      (1): BiFpnLayer(
        (fnode): ModuleList(
          (0): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (3): ResampleFeatureMap()
                (4): ResampleFeatureMap(
                  (upsample): Interpolate2d()
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (1): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (2): ResampleFeatureMap()
                (5): ResampleFeatureMap(
                  (upsample): Interpolate2d()
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (2): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (1): ResampleFeatureMap()
                (6): ResampleFeatureMap(
                  (upsample): Interpolate2d()
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (3): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (0): ResampleFeatureMap()
                (7): ResampleFeatureMap(
                  (upsample): Interpolate2d()
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (4): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (1): ResampleFeatureMap()
                (7): ResampleFeatureMap()
                (8): ResampleFeatureMap(
                  (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (5): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (2): ResampleFeatureMap()
                (6): ResampleFeatureMap()
                (9): ResampleFeatureMap(
                  (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (6): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (3): ResampleFeatureMap()
                (5): ResampleFeatureMap()
                (10): ResampleFeatureMap(
                  (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (7): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (4): ResampleFeatureMap()
                (11): ResampleFeatureMap(
                  (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
        )
      )
      (2): BiFpnLayer(
        (fnode): ModuleList(
          (0): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (3): ResampleFeatureMap()
                (4): ResampleFeatureMap(
                  (upsample): Interpolate2d()
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (1): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (2): ResampleFeatureMap()
                (5): ResampleFeatureMap(
                  (upsample): Interpolate2d()
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (2): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (1): ResampleFeatureMap()
                (6): ResampleFeatureMap(
                  (upsample): Interpolate2d()
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (3): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (0): ResampleFeatureMap()
                (7): ResampleFeatureMap(
                  (upsample): Interpolate2d()
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (4): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (1): ResampleFeatureMap()
                (7): ResampleFeatureMap()
                (8): ResampleFeatureMap(
                  (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (5): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (2): ResampleFeatureMap()
                (6): ResampleFeatureMap()
                (9): ResampleFeatureMap(
                  (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (6): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (3): ResampleFeatureMap()
                (5): ResampleFeatureMap()
                (10): ResampleFeatureMap(
                  (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (7): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (4): ResampleFeatureMap()
                (11): ResampleFeatureMap(
                  (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
        )
      )
      (3): BiFpnLayer(
        (fnode): ModuleList(
          (0): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (3): ResampleFeatureMap()
                (4): ResampleFeatureMap(
                  (upsample): Interpolate2d()
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (1): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (2): ResampleFeatureMap()
                (5): ResampleFeatureMap(
                  (upsample): Interpolate2d()
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (2): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (1): ResampleFeatureMap()
                (6): ResampleFeatureMap(
                  (upsample): Interpolate2d()
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (3): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (0): ResampleFeatureMap()
                (7): ResampleFeatureMap(
                  (upsample): Interpolate2d()
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (4): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (1): ResampleFeatureMap()
                (7): ResampleFeatureMap()
                (8): ResampleFeatureMap(
                  (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (5): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (2): ResampleFeatureMap()
                (6): ResampleFeatureMap()
                (9): ResampleFeatureMap(
                  (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (6): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (3): ResampleFeatureMap()
                (5): ResampleFeatureMap()
                (10): ResampleFeatureMap(
                  (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
          (7): Fnode(
            (combine): FpnCombine(
              (resample): ModuleDict(
                (4): ResampleFeatureMap()
                (11): ResampleFeatureMap(
                  (downsample): MaxPool2d(kernel_size=3, stride=2, padding=1, dilation=1, ceil_mode=False)
                )
              )
            )
            (after_combine): Sequential(
              (act): ReLU(inplace=True)
              (conv): ConvBnAct2d(
                (conv): Conv2d(88, 88, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
                (bn): BatchNorm2d(88, eps=0.001, momentum=0.01, affine=True, track_running_stats=True)
              )
            )
          )
        )
      )
    )
  )
  (class_net): HeadNet(
    (conv_rep): ModuleList(
      (0): ConvBnAct2d(
        (conv): Conv2d(88, 44, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      )
      (1-2): 2 x ConvBnAct2d(
        (conv): Conv2d(44, 44, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      )
    )
    (bn_rep): ModuleList(
      (0-2): 3 x ModuleList(
        (0-4): 5 x BatchNorm2d(44, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (act): ReLU(inplace=True)
    (predict): ConvBnAct2d(
      (conv): Conv2d(44, 9, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (box_net): HeadNet(
    (conv_rep): ModuleList(
      (0): ConvBnAct2d(
        (conv): Conv2d(88, 44, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      )
      (1-2): 2 x ConvBnAct2d(
        (conv): Conv2d(44, 44, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
      )
    )
    (bn_rep): ModuleList(
      (0-2): 3 x ModuleList(
        (0-4): 5 x BatchNorm2d(44, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
    )
    (act): ReLU(inplace=True)
    (predict): ConvBnAct2d(
      (conv): Conv2d(44, 36, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
)
